sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/createContact.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.createContact">
   <soapenv:Header/>
   <soapenv:Body>
     <sug:sugarcrmUrl>https://nyqcvr4839.trial.sugarcrm.eu//soap.php</sug:sugarcrmUrl>
     <sug:username>admin</sug:username>
     <sug:password>61BD60C60D9FB60CC8FC7767669D40A1</sug:password>
     <sug:first_name>kuna</sug:first_name>>
     <sug:last_name>s</sug:last_name>
     <sug:email_address>s@a.com</sug:email_address>
   </soapenv:Body>
</soapenv:Envelope>